Documents/ЛБ_ПриходОтходовДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПриходОтходовДМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДвижениеОтходов</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОтходыДМВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВесОбщий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБезТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезТары</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Тара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОтходыДМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходОтходовДМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПеремещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладнойПеремещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОтходыДМВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОтходыДМВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходОтходовДМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОтходыДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОтходыДМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятьПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оприходовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переместить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийСкладЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлеймениеМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспертиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаОбщая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМОбщий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Находки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мониторинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйЦентр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_РасходОтходовДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РасходОтходовДМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДвижениеОтходов</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОтходыДМВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБезТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОтходыДМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЛБ_Тара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Тара</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДейстующаяТара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЛБ_ПриходОтходовДМ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем НеРедактировать Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ВидОперации.СписокВыбора.Очистить();
	Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийОтходыДМ.Оприходовать);
	Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийОтходыДМ.ПринятьПеремещение);
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.Дата = ТекущаяДата();
		
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		Иначе
			Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
		КонецЕсли;
		
		Если Параметры.Свойство("Ломбард") Тогда
			Объект.Ломбард = Параметры.Ломбард;
		Иначе
			Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		КонецЕсли;
		
		//+МАН 17.12.25
		ЗаполнитьСклады(Истина);
		
		Если Параметры.Свойство("Склад") Тогда
			Объект.Склад = Параметры.Склад;
		КонецЕсли;
		//-МАН
		
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
		
		ЕстьДействующие = ПолучитьДейтствующиюТару(Объект.Ломбард);
		
		Если ЕстьДействующие.Дуствующая <> Неопределено Тогда
			Объект.ВесТары = ЕстьДействующие.Ссылка.ВесТары;
			Объект.Тара = ЕстьДействующие.Ссылка;
		КонецЕсли;

		Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОтходыДМ.Оприходовать;
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОтходыДМ.ПринятьПеремещение Тогда
		ЗаполнитьЛомбардыОтправители(Объект.Дата, Объект.Ломбард, Объект.Склад);
	КонецЕсли;

	//+МАН 17.12.25
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ЗаполнитьСклады();
	КонецЕсли;
	//-МАН
	
	Если Объект.Склад.ВидСклада = Перечисления.ЛБ_ВидыСкладов.ОтходыДМЦО Тогда
		Элементы.ВидОперации.СписокВыбора.Очистить();
		Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийОтходыДМ.Оприходовать);
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДейтствующиюТару(Ломбард)

	Результат = Новый Структура("Ссылка, Дуствующая");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_Тара.Ссылка КАК Ссылка,
		|	ЛБ_Тара.ДейстующаяТара КАК ДейстующаяТара
		|ИЗ
		|	Справочник.ЛБ_Тара КАК ЛБ_Тара
		|ГДЕ
		|	ЛБ_Тара.Ломбард = &Ломбард
		|	И ЛБ_Тара.ДейстующаяТара = ИСТИНА";
	
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Результат.Ссылка = РезультатЗапроса.Ссылка;
		Результат.Дуствующая = РезультатЗапроса.ДейстующаяТара;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура БезТарыПриИзменении(Элемент)
	//+МАН 17.12.25
	//Если Объект.БезТары Тогда
	//	Элементы.ВесТары.Видимость = Ложь;
	//	Элементы.ВесОбщий.Заголовок = "Вес без тары, гр";
	//Иначе
	//	Элементы.ВесТары.Видимость = Истина;
	//	Элементы.ВесОбщий.Заголовок = "Вес с тарой, гр";
	//КонецЕсли;
	
	УстановитьВидимость();
	//-МАН
	
	РасчитатьВес();
	
КонецПроцедуры

&НаКлиенте
Процедура ВесОбщийПриИзменении(Элемент)
	РасчитатьВес();
КонецПроцедуры

&НаСервере
Процедура РасчитатьВес()
	Если Объект.БезТары Тогда
		Объект.ВесБезТары = Объект.ВесОбщий;
	Иначе
		Объект.ВесБезТары = Объект.ВесОбщий - Объект.ВесТары;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.Тара) И НЕ Объект.БезТары Тогда
		Предупреждение("Внимание! Для оприходования отходов ДМ необходимо добавить действующую тару в «Справочник тары»!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.ВесОбщий = 0 Тогда
		Предупреждение("Не указан вес!
		|Проведение документа невозможно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.ВесОбщий > 0 И Объект.ВесБезТары = 0 Тогда
		Предупреждение("Вес нетто не может быть равен нулю.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	//+МАН 17.12.25
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Предупреждение("Не выбран склад получатель.
		|Проведение документа невозможно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОтходыДМ.ПринятьПеремещение") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ЛомбардОтправитель) Тогда
			Предупреждение("Не выбран ломбард отправитель.
			|Проведение документа невозможно.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда
			Предупреждение("Не выбран склад отправитель.
			|Проведение документа невозможно.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//-МАН
	
	УстановитьПользователя();

КонецПроцедуры

&НаСервере
Процедура УстановитьПользователя()
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	Иначе
		Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()

	Если Объект.Проведен Тогда
		НеРедактировать = Истина;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		ЭтотОбъект.ТолькоПросмотр = НеРедактировать;
		//+МАН 15.01.25
		Элементы.ВыбратьДокументПеремещения.Доступность = Ложь;
		//-МАН
	Иначе
		НеРедактировать = Ложь;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		ЭтотОбъект.ТолькоПросмотр = НеРедактировать;
		//+МАН 15.01.25
		Элементы.ВыбратьДокументПеремещения.Доступность = Истина;
		//-МАН
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ЭтаФорма.Заголовок = "Приход отходов ДМ " + Объект.НомерДокумента + " от " + Объект.Дата;
	Иначе
		ЭтаФорма.Заголовок = "Приход отходов ДМ";
	КонецЕсли;
	
	//+МАН 17.12.25
	Если Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОтходыДМ.Оприходовать Тогда
		Элементы.ГруппаПеремещения.Видимость = Ложь;
		//Элементы.ГруппаПриходПеремещения.Видимость = Ложь;
		Элементы.ВесОбщий.ТолькоПросмотр = Ложь;
		Элементы.БезТары.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ГруппаПеремещения.Видимость = Истина;
		//Элементы.ГруппаПриходПеремещения.Видимость = Истина;
		Элементы.ВесОбщий.ТолькоПросмотр = Истина;
		Элементы.БезТары.ТолькоПросмотр = Истина;
	КонецЕсли;

	Если Объект.БезТары Тогда
		Элементы.ВесТары.Видимость = Ложь;
		Элементы.ВесОбщий.Заголовок = "Вес без тары, гр";
	Иначе
		Элементы.ВесТары.Видимость = Истина;
		Элементы.ВесОбщий.Заголовок = "Вес с тарой, гр";
	КонецЕсли;
	//-МАН
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимость();
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Оповестить("Проведение_ЛБ_ПриходОтходовДМ", "ОбновитьСписок", Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

//+МАН 17.12.25
&НаСервере
Функция ЗаполнитьСписокВыбораСкладов(Ломбард)

	МассивСкладов = Новый Массив;
	
	Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_Склады.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
		               |ГДЕ
		               |	ЛБ_Склады.Владелец = &Владелец
		               |	И (ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМ)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМЦО)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМОбщий))";
		Запрос.УстановитьПараметр("Владелец", Ломбард);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивСкладов.Добавить(Выборка.Ссылка);
		Конеццикла;
	КонецЕсли;
	
	Возврат МассивСкладов;
КонецФункции

&НаСервере
Процедура ЗаполнитьСклады(НовыйДокумент = Ложь)
	Если ЗначениеЗаполнено(Объект.Ломбард) Тогда
		Склады = ЗаполнитьСписокВыбораСкладов(Объект.Ломбард);
		
		Если Склады.Количество() > 1 Тогда
			Элементы.Склад.СписокВыбора.Очистить();
			Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(Склады);
		ИначеЕсли Склады.Количество() = 1 Тогда
			Элементы.Склад.СписокВыбора.Очистить();
			Элементы.Склад.СписокВыбора.Добавить(Склады[0]);
			
			Если НЕ НовыйДокумент Тогда
				Объект.Склад = Склады[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЛомбардОтправитель) Тогда
		Склады = ЗаполнитьСписокВыбораСкладов(Объект.ЛомбардОтправитель);
		
		Если Склады.Количество() > 1 Тогда
			Элементы.СкладОтправитель.СписокВыбора.Очистить();
			Элементы.СкладОтправитель.СписокВыбора.ЗагрузитьЗначения(Склады);
		ИначеЕсли Склады.Количество() = 1 Тогда
			Элементы.СкладОтправитель.СписокВыбора.Очистить();
			Элементы.СкладОтправитель.СписокВыбора.Добавить(Склады[0]);

			Если НЕ НовыйДокумент Тогда
				Объект.СкладОтправитель = Склады[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.БезТары = Истина;
	
	УстановитьВидимость();
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОтходыДМ.ПринятьПеремещение") Тогда
		ЗаполнитьЛомбардыОтправители(Объект.Дата, Объект.Ломбард, Объект.Склад);
	Иначе
		Объект.ЛомбардОтправитель = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ПустаяСсылка");
		Объект.СкладОтправитель = ПредопределенноеЗначение("Справочник.ЛБ_Склады.ПустаяСсылка");
		СброситьДанныеПеремещения();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛомбардыОтправители(Дата, Ломбард, Склад)

	Элементы.ЛомбардОтправитель.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтходыДМВПутиОстатки.ЛомбардОтправитель КАК ЛомбардОтправитель
		|ИЗ
		|	РегистрНакопления.ЛБ_ОтходыДМВПути.Остатки(
		|			&Дата,
		|			ЛомбардПолучатель = &ЛомбардПолучатель
		|				И Организация = &Организация
		|				И СкладПолучатель = &Склад
		|				И 111 = 111) КАК ЛБ_ОтходыДМВПутиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛБ_ОтходыДМВПутиОстатки.ЛомбардОтправитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛомбардОтправитель УБЫВ";
	
	Если Ломбард <> Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "ЛомбардОтправитель В
		|					(ВЫБРАТЬ
		|						ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|					ИЗ
		|						РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, ВЫБОР
		|							КОГДА Отделение В
		|									(ВЫБРАТЬ
		|										ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|									ИЗ
		|										РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &ЛомбардПолучатель) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)
		|								ТОГДА ИСТИНА
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|					ГДЕ
		|						НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		|						И НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.ПометкаУдаления)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЛомбардПолучатель", Ломбард);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Если Результат.ЛомбардОтправитель = Ломбард Тогда
			Продолжить;
		КонецЕсли;
		Элементы.ЛомбардОтправитель.СписокВыбора.Добавить(Результат.ЛомбардОтправитель);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЛомбардОтправительПриИзменении(Элемент)
	ЗаполнитьСклады();
	
	//Если ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда
	//	ПолучитьДоступныйОстаток();
	//КонецЕсли;
	
	СброситьДанныеПеремещения();

КонецПроцедуры

Процедура ПолучитьДоступныйОстаток();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтходыДМВПутиОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток
		|ИЗ
		|	РегистрНакопления.ЛБ_ОтходыДМВПути.Остатки(
		|			&Дата,
		|			ЛомбардПолучатель = &ЛомбардПолучатель
		|				И Организация = &Организация
		|				И ЛомбардОтправитель = &ЛомбардОтправитель
		|				И СкладОтправитель = &СкладОтправитель
		|				И СкладПолучатель = &Склад) КАК ЛБ_ОтходыДМВПутиОстатки";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ЛомбардПолучатель", Объект.Ломбард);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ЛомбардОтправитель", Объект.ЛомбардОтправитель);
	Запрос.УстановитьПараметр("СкладОтправитель", Объект.СкладОтправитель);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Объект.ВесОбщий = Результат.ВесНеттоОстаток;
		Объект.ВесБезТары = Результат.ВесНеттоОстаток;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	//ПолучитьДоступныйОстаток()
	СброситьДанныеПеремещения();
КонецПроцедуры

&НаКлиенте
Процедура СброситьДанныеПеремещения()
	Объект.ДокументПеремещения = ПредопределенноеЗначение("Документ.ЛБ_РасходОтходовДМ.ПустаяСсылка");
	Объект.ВесОбщий = 0;
	Объект.ВесБезТары = 0;
	Объект.НомерНакладнойПеремещения = "";
	Объект.ДатаДокументаПеремещения = Дата(1,1,1);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокументПеремещения(Команда)
	
	Если ЗначениеЗаполнено(Объект.ЛомбардОтправитель) И ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЛомбардПолучатель", Объект.Ломбард);
		ПараметрыФормы.Вставить("СкладПолучатель", Объект.Склад);
		ПараметрыФормы.Вставить("ЛомбардОтправитель", Объект.ЛомбардОтправитель);
		ПараметрыФормы.Вставить("СкладОтправитель", Объект.СкладОтправитель);
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Форма", "Документ");
		
		ОписаниеОповещенияПослеВыбораДокумента = Новый ОписаниеОповещения("ПослеВыбораДокумента", ЭтотОбъект);
		
		ОткрытьФорму("Документ.ЛБ_ПриходОтходовДМ.Форма.ФормаВПути", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещенияПослеВыбораДокумента, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Невыбран ломбард или склад отправитель");
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораДокумента(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДокументПеремещения = Результат;
	Объект.ВесОбщий = Результат.ВесБезТары;
	Объект.ВесБезТары = Результат.ВесБезТары;
	Объект.НомерНакладнойПеремещения = Результат.НомерНакладной;
	Объект.ДатаДокументаПеремещения = Результат.Дата;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардОтправительНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Элемент.СписокВыбора.Количество() = 0 Тогда
		Предупреждение("Нет перещений для оприходования");
		Возврат
	КонецЕсли;
КонецПроцедуры
//-МАН
